/*Создать новый класс, который буддет выводит
* имен членов вашей семьи, каждое с новой
* строки. Придумать классу соответствующее
* названия */
public class FamileName {
    public static void main(String[] args) {
        System.out.println("Ольга");
        System.out.println("Serge");
        System.out.println("Владимир");
        System.out.println("Любовь");
    }
}
